In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
        "name":["Ravi", "Kumar", "Shivay", "Pranjal", "Abhay"],
        "marks":[56,55,79,21,39],
        "city":["Agra","Mumbai","Jaipur","Surat","Ahmedabad"],
        }

# DataFrame

In [3]:
df = pd.DataFrame(dict) # converts into Dataframe means excelsheet

In [4]:
df

      name  marks       city
0     Ravi     56       Agra
1    Kumar     55     Mumbai
2   Shivay     79     Jaipur
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [5]:
# df.to_csv("hello.csv") # used to convert table into csv

In [6]:
# df.to_csv("hello.csv", index=False) # used to convert table into csv without index

In [7]:
df.head(2) # used to show data from top

    name  marks    city
0   Ravi     56    Agra
1  Kumar     55  Mumbai

In [8]:
df.tail(2) # used to show data from down

      name  marks       city
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [9]:
df.describe()

           marks
count   5.000000
mean   50.000000
std    21.587033
min    21.000000
25%    39.000000
50%    55.000000
75%    56.000000
max    79.000000

In [10]:
check = pd.read_csv('Marks.csv')

In [11]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  53.018
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [12]:
check['Marks']

0      19.202
1       7.734
2      13.811
3      53.018
4      55.299
        ...
96      5.609
97     41.444
98     12.027
99     32.357
100       NaN
Name: Marks, Length: 101, dtype: float64

In [13]:
check['Marks'][30] # index value

np.float64(24.172)

In [14]:
check['Marks'][3]=51.22 # change the value

C:\Users\asus\AppData\Local\Temp\ipykernel_11216\1440393980.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  check['Marks'][3]=51.22 # change the value

In [15]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  51.220
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [16]:
df.index=['a','b','c','d','e'] # used to change index type

In [17]:
df

      name  marks       city
a     Ravi     56       Agra
b    Kumar     55     Mumbai
c   Shivay     79     Jaipur
d  Pranjal     21      Surat
e    Abhay     39  Ahmedabad

In [18]:
 ser=pd.Series(np.random.rand(15)) # Random 15 value in series

In [19]:
ser

0     0.576430
1     0.146760
2     0.851995
3     0.664764
4     0.566897
5     0.960802
6     0.697891
7     0.562772
8     0.580476
9     0.513955
10    0.254052
11    0.793762
12    0.979956
13    0.845959
14    0.390421
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [21]:
newdf = pd.DataFrame(np.random.rand(200,4), index=np.arange(200))

In [22]:
newdf

            0         1         2         3
0    0.684294  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982  0.267499  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132
..        ...       ...       ...       ...
195  0.417167  0.378299  0.497736  0.531092
196  0.282420  0.769701  0.617560  0.775971
197  0.947142  0.760577  0.693546  0.771514
198  0.747428  0.877171  0.681650  0.041349
199  0.211184  0.512412  0.218576  0.411197

[200 rows x 4 columns]

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [25]:
newdf

            0         1         2         3
0    0.684294  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982  0.267499  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132
..        ...       ...       ...       ...
195  0.417167  0.378299  0.497736  0.531092
196  0.282420  0.769701  0.617560  0.775971
197  0.947142  0.760577  0.693546  0.771514
198  0.747428  0.877171  0.681650  0.041349
199  0.211184  0.512412  0.218576  0.411197

[200 rows x 4 columns]

In [26]:
newdf

            0         1         2         3
0    0.684294  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982  0.267499  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132
..        ...       ...       ...       ...
195  0.417167  0.378299  0.497736  0.531092
196  0.282420  0.769701  0.617560  0.775971
197  0.947142  0.760577  0.693546  0.771514
198  0.747428  0.877171  0.681650  0.041349
199  0.211184  0.512412  0.218576  0.411197

[200 rows x 4 columns]

In [27]:
newdf[2][2]= "Shiv"

C:\Users\asus\AppData\Local\Temp\ipykernel_11216\577704262.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[2][2]= "Shiv"
C:\Users\asus\AppData\Local\Temp\ipykernel_11216\577704262.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Shiv' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[2][2]= "Shiv"

In [28]:
newdf

            0         1         2         3
0    0.684294  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982      Shiv  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132
..        ...       ...       ...       ...
195  0.417167  0.378299  0.497736  0.531092
196  0.282420  0.769701   0.61756  0.775971
197  0.947142  0.760577  0.693546  0.771514
198  0.747428  0.877171   0.68165  0.041349
199  0.211184  0.512412  0.218576  0.411197

[200 rows x 4 columns]

In [29]:
newdf.dtypes

0    float64
1    float64
2     object
3    float64
dtype: object

In [30]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       190, 191, 192, 193, 194, 195, 196, 197, 198, 199],
      dtype='int64', length=200)

In [31]:
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [32]:
newdf[2][2]= 3.3

In [33]:
newdf

            0         1         2         3
0    0.684294  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982       3.3  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132
..        ...       ...       ...       ...
195  0.417167  0.378299  0.497736  0.531092
196  0.282420  0.769701   0.61756  0.775971
197  0.947142  0.760577  0.693546  0.771514
198  0.747428  0.877171   0.68165  0.041349
199  0.211184  0.512412  0.218576  0.411197

[200 rows x 4 columns]

In [34]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
0,0.684294,0.389284,0.491753,0.451256,0.067097,0.071281,0.389119,0.112348,0.712144,0.642214,...,0.678921,0.355142,0.493498,0.092026,0.04228,0.417167,0.28242,0.947142,0.747428,0.211184
1,0.296155,0.688112,0.649982,0.11663,0.682936,0.364934,0.981292,0.359305,0.900051,0.786872,...,0.968318,0.14356,0.447967,0.075855,0.03758,0.378299,0.769701,0.760577,0.877171,0.512412
2,0.574468,0.969492,3.3,0.840021,0.349067,0.974244,0.070925,0.900719,0.824866,0.434892,...,0.454703,0.146235,0.290836,0.213358,0.851732,0.497736,0.61756,0.693546,0.68165,0.218576
3,0.314254,0.58173,0.830381,0.599547,0.548132,0.804516,0.115725,0.857427,0.749063,0.081065,...,0.575446,0.998758,0.950518,0.877049,0.25474,0.531092,0.775971,0.771514,0.041349,0.411197

In [35]:
newdf.head()

          0         1         2         3
0  0.684294  0.296155  0.574468  0.314254
1  0.389284  0.688112  0.969492  0.581730
2  0.491753  0.649982       3.3  0.830381
3  0.451256  0.116630  0.840021  0.599547
4  0.067097  0.682936  0.349067  0.548132

In [36]:
newdf.sort_index(axis=0, ascending=False) # decreasing order sorting

            0         1         2         3
199  0.211184  0.512412  0.218576  0.411197
198  0.747428  0.877171   0.68165  0.041349
197  0.947142  0.760577  0.693546  0.771514
196  0.282420  0.769701   0.61756  0.775971
195  0.417167  0.378299  0.497736  0.531092
..        ...       ...       ...       ...
4    0.067097  0.682936  0.349067  0.548132
3    0.451256  0.116630  0.840021  0.599547
2    0.491753  0.649982       3.3  0.830381
1    0.389284  0.688112  0.969492  0.581730
0    0.684294  0.296155  0.574468  0.314254

[200 rows x 4 columns]

In [37]:
newdf.dtypes

0    float64
1    float64
2     object
3    float64
dtype: object

In [38]:
newdf[2]

0      0.574468
1      0.969492
2           3.3
3      0.840021
4      0.349067
         ...
195    0.497736
196     0.61756
197    0.693546
198     0.68165
199    0.218576
Name: 2, Length: 200, dtype: object

In [39]:
newdf2= newdf

In [40]:
newdf2[0][0]=322 # will change value of both because it acts as a view

C:\Users\asus\AppData\Local\Temp\ipykernel_11216\3142945722.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=322
C:\Users\asus\AppData\Local\Temp\ipykernel_11216\3142945722.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=322

In [41]:
newdf2.head()

            0         1         2         3
0  322.000000  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982       3.3  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132

In [42]:
newdf.head()

            0         1         2         3
0  322.000000  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982       3.3  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132

In [43]:
newdf3=newdf.copy() # it will send copy no change will happen in newdf

In [44]:
newdf3[1][1]=892

C:\Users\asus\AppData\Local\Temp\ipykernel_11216\2818132362.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[1][1]=892
C:\Users\asus\AppData\Local\Temp\ipykernel_11216\2818132362.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[1][1]=892

In [45]:
newdf3.head()

            0           1         2         3
0  322.000000    0.296155  0.574468  0.314254
1    0.389284  892.000000  0.969492  0.581730
2    0.491753    0.649982       3.3  0.830381
3    0.451256    0.116630  0.840021  0.599547
4    0.067097    0.682936  0.349067  0.548132

In [46]:
newdf.head()

            0         1         2         3
0  322.000000  0.296155  0.574468  0.314254
1    0.389284  0.688112  0.969492  0.581730
2    0.491753  0.649982       3.3  0.830381
3    0.451256  0.116630  0.840021  0.599547
4    0.067097  0.682936  0.349067  0.548132